---
kind: method
id: M:Autodesk.Revit.DB.SpatialElementFromToCalculationPoints.Flip
source: html/7c873a16-4dcd-3a46-6b11-895d4ba48dc8.htm
---
# Autodesk.Revit.DB.SpatialElementFromToCalculationPoints.Flip Method

flip the direction of the "from" and "to" points

## Syntax (C#)
```csharp
public void Flip()
```